/*
*	全国三级城市联动 js版
*/
function Dsy(){
	this.Items = {};
}
Dsy.prototype.add = function(id,iArray){
	this.Items[id] = iArray;
}
Dsy.prototype.Exists = function(id){
	if(typeof(this.Items[id]) == "undefined") return false;
	return true;
}

function change(v){
	var str="0";
	for(i=0;i<v;i++){
		str+=("_"+(document.getElementById(s[i]).selectedIndex-1));
	};
	var ss=document.getElementById(s[v]);
	with(ss){
		length = 0;
		options[0]=new Option(opt0[v],opt0[v]);
		if(v && document.getElementById(s[v-1]).selectedIndex>0 || !v){
			if(dsy.Exists(str)){
				ar = dsy.Items[str];
				for(i=0;i<ar.length;i++){
					options[length]=new Option(ar[i],ar[i]);
				}//end for
				if(v){ options[0].selected = true; }
			}
		}//end if v
		if(++v<s.length){change(v);}
	}//End with
}

var dsy = new Dsy();

dsy.add("0",["北京","山西","辽宁","上海","江苏","浙江","安徽","福建","河南","湖南","广东","重庆","四川","陕西","甘肃","宁夏回族自治区"]);
dsy.add("0_0_0",["中国人民解放军总医院301医院体检中心","美年大健康体检中心","中国人民解放军第302医院体检中心","中国航天中心医院体检中心","慈铭体检中心","首都医科大学附属北京儿童医院保健中心","首都医科大学附属宣武医院体检中心","首都医科大学附属北京安贞医院体检中心","北京协和医院体检中心(东院)","爱康国宾体检中心","慈铭体检中心","瑞慈体检中心","九华健康体检中心","美兆体检中心","爱基因体检中心","北京松乔健康体检中心"]);
dsy.add("0_0",["北京"]);
dsy.add("0_1_0",["山西尚宁健康体检中心","和谐健康体检中心"]);
dsy.add("0_1",["太原"]);
dsy.add("0_2_0",["沈阳阳光体检中心铁西分院","沈阳阳光体检中心"]);
dsy.add("0_2",["辽宁"]);
dsy.add("0_3_0",["上海市第六人民医院体检中心","上海童康体检中心","上海长征医院体检中心","上海仁爱医院体检中心","上海岳阳医院体检中心","上海交通大学华检体检中心","上海455医院体检中心","上海东方医院体检中心","上海交通大学附属仁济医院南院体检中心","美年大健康体检中心"]);
dsy.add("0_3",["上海"]);
dsy.add("0_4_0",["江苏省省级机关医院体检中心"]);
dsy.add("0_4",["南京"]);
dsy.add("0_5_0",["空军杭州疗养院体检中心","杭州艾博体检中心","浙江省绿城医院体检中心","浙江省立同德医院体检中心","绿城九溪玫瑰园体检中心","浙江省中医院体检中心"]);
dsy.add("0_5_1",["武警浙江总队医院体检中心","嘉兴康石体检中心"]);
dsy.add("0_5_2",["宁波大学附属医院体检中心","宁波解放军第113医院体检中心","宁波第一医院体检中心","鄞州人民医院体检中心","宁波海曙天一健康体检中心","浙江大学明州医院国际保健中心PET-CT"]);
dsy.add("0_5_3",["绍兴市中医院体检中心"]);
dsy.add("0_5",["杭州","嘉兴","宁波","绍兴"]);
dsy.add("0_6_0",["合肥名流体检中心","合肥105医院体检中心","安徽省第二人民医院（黄山路院区）体检中心"]);
dsy.add("0_6",["合肥"]);
dsy.add("0_7_0",["福建医科大学附属协和医院体检中心","福州市第一医院体检中心","福建医科大学附属第一医院体检中心","福州慈铭健康体检中心"]);
dsy.add("0_7_1",["泉州180医院体检中心","福建省泉州海体健康体检中心","泉州延年健康管理中心"]);
dsy.add("0_7_2",["中信健康管理厦门体检中心"]);
dsy.add("0_7",["福州","泉州","厦门"]);
dsy.add("0_8_0",["郑州仁人健康体检中心","郑煤仁记体检院体检中心","郑州豫慈体检中心"]);
dsy.add("0_8",["郑州"]);
dsy.add("0_9_0",["长沙市岳麓区人民医院体检中心","长沙市第三医院体检中心","长沙市第四医院体检中心","新华卓越（长沙）健康体检中心"]);
dsy.add("0_9_1",[" 郴州东华医院健康体检管理中心"]);
dsy.add("0_9",["长沙","郴州"]);
dsy.add("0_10_0",["深圳市第五人民医院(罗湖医院)体检中心","深圳第一健康体检中心","深圳博爱医院体检中心","深圳第六人民医院（南山医院）体检中心","深圳市中医院体检中心","深圳市人民医院体检中心","深圳市人民医院体检中心(一门诊分部)","深圳第一健康体检中心","中信健康体检中心"]);
dsy.add("0_10_1",["广东顺德中医药大学医院体检中心","广州华侨医院（暨南大学附属第一医院）体检中心","南方医科大学中西医结合医院体检中心","广州金域体检中心","广州中山大学附属第六医院影像检验中心"]);
dsy.add("0_10_2",["东莞福华健康体检中心"]);
dsy.add("0_10_3",["广东省中山市人民医院体检中心"]);
dsy.add("0_10",["深圳","广州","东莞","中山"]);
dsy.add("0_11_0",["重庆第三人民医院体检中心","重庆佳音医院体检中心","下城重庆大坪医院体中心区"]);
dsy.add("0_11",["重庆"]);
dsy.add("0_12_0",["成都成飞医院体检中心"]);
dsy.add("0_12",["成都"]);
dsy.add("0_13_0",["智行深度（精密）体检中心","新华健康体检中心","普惠体检中心"]);
dsy.add("0_13_1",["陕西汉中市美康体检中心"]);
dsy.add("0_13",["西安","汉中"]);
dsy.add("0_14_0",["武威市体检报告中心"]);
dsy.add("0_14",["兰州"]);
dsy.add("0_15_0",["宁夏银川博尚体检中心"]);
dsy.add("0_15",["银川"]);
dsy.add("0",["北京","山西","辽宁","上海","江苏","浙江","安徽","福建","河南","湖南","广东","重庆","四川","陕西","甘肃","宁夏回族自治区"]);

var s=["s_province","s_city","s_county"];//三个select的name
var opt0 = ["请选择","请选择","请选择"];//初始值
function _init_area(){  //初始化函数
	for(i=0;i<s.length-1;i++){
	  document.getElementById(s[i]).onchange=new Function("change("+(i+1)+")");
	}
	change(0);
}
_init_area();
